# Manipulating DataFrames with Pandas

You'll learn how to leverage pandas' extremely powerful data manipulation engine to get the most out of your data. Youâ€™ll learn how to drill into the data that really matters by extracting, filtering, and transforming data from DataFrames. The pandas library has many techniques that make this process efficient and intuitive. You will learn how to tidy, rearrange, and restructure your data by pivoting or melting and stacking or unstacking DataFrames.

## Index ordering

In this exercise, the DataFrame `election` is provided for you. It contains the 2012 US election results for the state of Pennsylvania with county names as row indices. Your job is to select `'Bedford'` county and the `'winner'` column.

In [1]:
import pandas as pd

In [4]:
election = pd.read_csv('data/election.csv', index_col='county')

In [5]:
election.head()

          state   total      Obama     Romney  winner  voters
county
Adams        PA   41973  35.482334  63.112001  Romney   61156
Allegheny    PA  614671  56.640219  42.185820   Obama  924351
Armstrong    PA   28322  30.696985  67.901278  Romney   42147
Beaver       PA   80015  46.032619  52.637630  Romney  115157
Bedford      PA   21444  22.057452  76.986570  Romney   32189

In [6]:
election.loc['Bedford', 'winner']

'Romney'

In [17]:
election.info()

<class 'pandas.core.frame.DataFrame'>
Index: 67 entries, Adams to York
Data columns (total 6 columns):
state     67 non-null object
total     67 non-null int64
Obama     67 non-null float64
Romney    67 non-null float64
winner    67 non-null object
voters    67 non-null int64
dtypes: float64(2), int64(2), object(2)
memory usage: 6.2+ KB

## Positional and labeled indexing

Given a pair of label-based indices, sometimes it's necessary to find the corresponding positions. In this exercise, you will use the Pennsylvania election results again.

Find `x` and `y` such that `election.iloc[x, y] == election.loc['Bedford', 'winner']`. That is, what is the row position of 'Bedford', and the column position of 'winner'? Remember that the first position in Python is 0, not 1!

To answer this question, first explore the DataFrame using `election.head()` in the IPython Shell and inspect it with your eyes.

In [29]:
# Assign the row position of election.loc['Bedford']: x
x = 4

# Assign the column position of election['winner']: y
y = 4

# Assert the boolean equivalence
assert election.iloc[x, y] == election.loc['Bedford', 'winner']

Depending on the situation, you may wish to use `.iloc[]` over `.loc[]`, and vice versa. The important thing to realize is you can achieve the exact same results using either approach.

## Indexing and column rearrangement

There are circumstances in which it's useful to modify the order of your DataFrame columns. We do that now by extracting just two columns from the Pennsylvania election results DataFrame.

Your job is to assign a new DataFrame by selecting the list of columns `['winner', 'total', 'voters']`.

In [31]:
# Create a separate dataframe with the columns ['winner', 'total', 'voters']: results
results = election[['winner', 'total', 'voters']]

# Print the output of results.head()
results.head()

           winner   total  voters
county
Adams      Romney   41973   61156
Allegheny   Obama  614671  924351
Armstrong  Romney   28322   42147
Beaver     Romney   80015  115157
Bedford    Romney   21444   32189

## Slicing rows

The Pennsylvania US election results data set that you have been using so far is ordered by county name. This means that county names can be sliced alphabetically. In this exercise, you're going to perform slicing on the county names of the election DataFrame from the previous exercises.

In [32]:
# Slice the row labels 'Perry' to 'Potter': p_counties
p_counties = election.loc['Perry':'Potter']

# Print the p_counties DataFrame
print(p_counties)

# Slice the row labels 'Potter' to 'Perry' in reverse order: p_counties_rev
p_counties_rev = election.loc['Potter':'Perry':-1]

# Print the p_counties_rev DataFrame
print(p_counties_rev)

             state   total      Obama     Romney  winner   voters
county
Perry           PA   18240  29.769737  68.591009  Romney    27245
Philadelphia    PA  653598  85.224251  14.051451   Obama  1099197
Pike            PA   23164  43.904334  54.882576  Romney    41840
Potter          PA    7205  26.259542  72.158223  Romney    10913
             state   total      Obama     Romney  winner   voters
county
Potter          PA    7205  26.259542  72.158223  Romney    10913
Pike            PA   23164  43.904334  54.882576  Romney    41840
Philadelphia    PA  653598  85.224251  14.051451   Obama  1099197
Perry           PA   18240  29.769737  68.591009  Romney    27245

It looks like Obama did particularly well in Philadelphia.

## Slicing columns

Similar to row slicing, columns can be sliced by value. In this exercise, your job is to slice column names from the Pennsylvania election results DataFrame using `.loc[]`.

In [33]:
# Slice the columns from the starting column to 'Obama': left_columns
left_columns = election.loc[:, :'Obama']

# Print the output of left_columns.head()
print(left_columns.head())

# Slice the columns from 'Obama' to 'winner': middle_columns
middle_columns = election.loc[:, 'Obama':'winner']

# Print the output of middle_columns.head()
print(middle_columns.head())

# Slice the columns from 'Romney' to the end: 'right_columns'
right_columns = election.loc[:, 'Romney':]

# Print the output of right_columns.head()
print(right_columns.head())

          state   total      Obama
county
Adams        PA   41973  35.482334
Allegheny    PA  614671  56.640219
Armstrong    PA   28322  30.696985
Beaver       PA   80015  46.032619
Bedford      PA   21444  22.057452
               Obama     Romney  winner
county
Adams      35.482334  63.112001  Romney
Allegheny  56.640219  42.185820   Obama
Armstrong  30.696985  67.901278  Romney
Beaver     46.032619  52.637630  Romney
Bedford    22.057452  76.986570  Romney
              Romney  winner  voters
county
Adams      63.112001  Romney   61156
Allegheny  42.185820   Obama  924351
Armstrong  67.901278  Romney   42147
Beaver     52.637630  Romney  115157
Bedford    76.986570  Romney   32189

## Subselecting DataFrames with lists

You can use lists to select specific row and column labels with the `.loc[]` accessor. In this exercise, your job is to select the counties `['Philadelphia', 'Centre', 'Fulton']` and the columns `['winner','Obama','Romney']` from the `election` DataFrame with the index set to `'county'`.

In [34]:
# Create the list of row labels: rows
rows = ['Philadelphia', 'Centre', 'Fulton']

# Create the list of column labels: cols
cols = ['winner', 'Obama', 'Romney']

# Create the new DataFrame: three_counties
three_counties = election.loc[rows, cols]

# Print the three_counties DataFrame
print(three_counties)

              winner      Obama     Romney
county
Philadelphia   Obama  85.224251  14.051451
Centre        Romney  48.948416  48.977486
Fulton        Romney  21.096291  77.748861

## Thresholding data

In this exercise, we have provided the Pennsylvania election results and included a column called `'turnout'` that contains the percentage of voter turnout per county. Your job is to prepare a boolean array to select all of the rows and columns where voter turnout exceeded 70%.

In [35]:
election = pd.read_csv('data/election2.csv', index_col='county')
election.head()

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667
Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399
Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293
Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012
Bedford,PA,21444,22.057452,76.986570,Romney,32189,66.619031,54.929118

In [37]:
election.info()

<class 'pandas.core.frame.DataFrame'>
Index: 67 entries, Adams to York
Data columns (total 8 columns):
state      67 non-null object
total      67 non-null int64
Obama      67 non-null float64
Romney     67 non-null float64
winner     67 non-null object
voters     67 non-null int64
turnout    67 non-null float64
margin     67 non-null float64
dtypes: float64(4), int64(2), object(2)
memory usage: 4.7+ KB

In [40]:
# Create the boolean array: high_turnout
high_turnout = election['turnout'] > 70
high_turnout

county
Adams             False
Allegheny         False
Armstrong         False
Beaver            False
Bedford           False
Berks             False
Blair             False
Bradford          False
Bucks              True
Butler             True
Cambria           False
Cameron           False
Carbon            False
Centre            False
Chester            True
Clarion           False
Clearfield        False
Clinton           False
Columbia          False
Crawford          False
Cumberland        False
Dauphin           False
Delaware          False
Elk               False
Erie              False
Fayette           False
Forest             True
Franklin           True
Fulton            False
Greene            False
                  ...
Lebanon           False
Lehigh            False
Luzerne           False
Lycoming          False
McKean            False
Mercer            False
Mifflin           False
Monroe            False
Montgomery         True
Montour           False
Northampton       False
Northumberland    False
Perry             False
Philadelphia      False
Pike              False
Potter            False
Schuylkill        False
Snyder            False
Somerset          False
Sullivan          False
Susquehanna       False
Tioga             False
Union             False
Venango           False
Warren            False
Washington        False
Wayne             False
Westmoreland       True
Wyoming           False
York              False
Name: turnout, Length: 67, dtype: bool

In [43]:
# Filter the election DataFrame with the high_turnout array: high_turnout_df
high_turnout_df = election[high_turnout]

In [44]:
# Print the high_turnout_results DataFrame
high_turnout_df

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Bucks,PA,319407,49.966970,48.801686,Obama,435606,73.324748,1.165284
Butler,PA,88924,31.920516,66.816607,Romney,122762,72.436096,34.896091
Chester,PA,248295,49.228539,49.650617,Romney,337822,73.498766,0.422079
Forest,PA,2308,38.734835,59.835355,Romney,3232,71.410891,21.100520
Franklin,PA,62802,30.110506,68.583803,Romney,87406,71.850903,38.473297
Montgomery,PA,401787,56.637223,42.286834,Obama,551105,72.905708,14.350390
Westmoreland,PA,168709,37.567646,61.306154,Romney,238006,70.884347,23.738508

## Filtering columns using other columns

The election results DataFrame has a column labeled `'margin'` which expresses the number of extra votes the winner received over the losing candidate. This number is given as a percentage of the total votes cast. It is reasonable to assume that in counties where this margin was less than 1%, the results would be too-close-to-call.

Your job is to use boolean selection to filter the rows where the margin was less than 1. You'll then convert these rows of the 'winner' column to `np.nan` to indicate that these results are too close to declare a winner.

In [45]:
# Import numpy
import numpy as np

# Create the boolean array: too_close
too_close = election['margin'] < 1

# Assign np.nan to the 'winner' column where the results were too close to call
election.loc[too_close, 'winner'] = np.nan

# Print the output of election.info()
print(election.info())

<class 'pandas.core.frame.DataFrame'>
Index: 67 entries, Adams to York
Data columns (total 8 columns):
state      67 non-null object
total      67 non-null int64
Obama      67 non-null float64
Romney     67 non-null float64
winner     64 non-null object
voters     67 non-null int64
turnout    67 non-null float64
margin     67 non-null float64
dtypes: float64(4), int64(2), object(2)
memory usage: 7.2+ KB
None

## Filtering using NaNs

In certain scenarios, it may be necessary to remove rows and columns with missing data from a DataFrame. The `.dropna()` method is used to perform this action. You'll now practice using this method on a dataset obtained from Vanderbilt University, which consists of data from passengers on the Titanic.

The DataFrame has been pre-loaded for you as `titanic`. Explore it and you will note that there are many `NaNs`. You will focus specifically on the `'age'` and `'cabin'` columns in this exercise. Your job is to use `.dropna()` to remove rows where any of these two columns contains missing data and rows where all of these two columns contain missing data.

You'll also use the `.shape` attribute, which returns the number of rows and columns in a tuple from a DataFrame, or the number of rows from a Series, to see the effect of dropping missing values from a DataFrame.

Finally, you'll use the `thresh=` keyword argument to drop columns from the full dataset that have less than 1000 non-missing values.

In [48]:
titanic = pd.read_csv('data/titanic2.csv')
titanic = titanic.drop(['Unnamed: 0'], axis=1)
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [49]:
# Select the 'age' and 'cabin' columns: df
df = titanic[['age', 'cabin']]

# Print the shape of df
print(df.shape)

# Drop rows in df with how='any' and print the shape
print(df.dropna(how='any').shape)

# Drop rows in df with how='all' and print the shape
print(df.dropna(how='all').shape)

# Drop columns in titanic with less than 1000 non-missing values
print(titanic.dropna(thresh=1000, axis='columns').info())

(1309, 2)
(272, 2)
(1069, 2)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 10 columns):
pclass      1309 non-null int64
survived    1309 non-null int64
name        1309 non-null object
sex         1309 non-null object
age         1046 non-null float64
sibsp       1309 non-null int64
parch       1309 non-null int64
ticket      1309 non-null object
fare        1308 non-null float64
embarked    1307 non-null object
dtypes: float64(2), int64(4), object(4)
memory usage: 102.3+ KB
None

Usually you would want to avoid dropping too much of your data, but in some situations, it may be necessary.

## Using apply() to transform a column

The `.apply()` method can be used on a pandas DataFrame to apply an arbitrary Python function to every element. In this exercise you'll take daily weather data in Pittsburgh in 2013 obtained from Weather Underground.

A function to convert degrees Fahrenheit to degrees Celsius has been written for you. Your job is to use the `.apply()` method to perform this conversion on the `'Mean TemperatureF'` and `'Mean Dew PointF'` columns of the weather DataFrame.

In [51]:
weather = pd.read_csv('data/weather2.csv')
weather.head()

,Date,Max TemperatureF,Mean TemperatureF,Min TemperatureF,Max Dew PointF,Mean Dew PointF,Min DewpointF,Max Humidity,Mean Humidity,Min Humidity,...,Max VisibilityMiles,Mean VisibilityMiles,Min VisibilityMiles,Max Wind SpeedMPH,Mean Wind SpeedMPH,Max Gust SpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2013-1-1,32,28,21,30,27,16,100,89,77,...,10,6,2,10,8,NaN,0.00,8,Snow,277
1,2013-1-2,25,21,17,14,12,10,77,67,55,...,10,10,10,14,5,NaN,0.00,4,NaN,272
2,2013-1-3,32,24,16,19,15,9,77,67,56,...,10,10,10,17,8,26.0,0.00,3,NaN,229
3,2013-1-4,30,28,27,21,19,17,75,68,59,...,10,10,6,23,16,32.0,0.00,4,NaN,250
4,2013-1-5,34,30,25,23,20,16,75,68,61,...,10,10,10,16,10,23.0,0.21,5,NaN,221

In [52]:
# Write a function to convert degrees Fahrenheit to degrees Celsius: to_celsius
def to_celsius(F):
    return 5/9*(F - 32)

# Apply the function over 'Mean TemperatureF' and 'Mean Dew PointF': df_celsius
df_celsius = weather[['Mean TemperatureF','Mean Dew PointF']].apply(to_celsius)

# Reassign the column labels of df_celsius
df_celsius.columns = ['Mean TemperatureC', 'Mean Dew PointC']

# Print the output of df_celsius.head()
print(df_celsius.head())

   Mean TemperatureC  Mean Dew PointC
0          -2.222222        -2.777778
1          -6.111111       -11.111111
2          -4.444444        -9.444444
3          -2.222222        -7.222222
4          -1.111111        -6.666667

## Using .map() with a dictionary

The `.map()` method is used to transform values according to a Python dictionary look-up. In this exercise you'll practice this method while returning to working with the `election` DataFrame.

Your job is to use a dictionary to map the values `'Obama'` and `'Romney'` in the `'winner'` column to the values `'blue'` and `'red'`, and assign the output to the new column `'color'`.

In [53]:
# Create the dictionary: red_vs_blue
red_vs_blue = {'Obama':'blue', 'Romney':'red'}

# Use the dictionary to map the 'winner' column to the new column: election['color']
election['color'] = election['winner'].map(red_vs_blue)

# Print the output of election.head()
election.head()

,county,state,total,Obama,Romney,winner,voters,turnout,margin,color
0,Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667,red
1,Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399,blue
2,Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293,red
3,Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012,red
4,Bedford,PA,21444,22.057452,76.986570,Romney,32189,66.619031,54.929118,red

## Using vectorized functions

When performance is paramount, you should avoid using `.apply()` and `.map()` because those constructs perform Python for-loops over the data stored in a pandas Series or DataFrame. By using **vectorized functions** instead, you can loop over the data at the same speed as compiled code (C, Fortran, etc.)! NumPy, SciPy and pandas come with a variety of vectorized functions (called **Universal Functions** or **UFuncs** in NumPy).

You can even write your own vectorized functions, but for now we will focus on the ones distributed by NumPy and pandas.

You're going to import the `zscore` function from `scipy.stats` and use it to compute the deviation in voter turnout in Pennsylvania from the mean in fractions of the standard deviation. In statistics, the `z-score` is the number of standard deviations by which an observation is above the mean - so if it is negative, it means the observation is below the mean.

Instead of using `.apply()` as you did in the earlier exercises, the `zscore` UFunc will take a pandas Series as input and return a NumPy array. You will then assign the values of the NumPy array to a new column in the DataFrame. You will be working with the `election` DataFrameu.

In [54]:
# Import zscore from scipy.stats
from scipy.stats import zscore

# Call zscore with election['turnout'] as input: turnout_zscore
turnout_zscore = zscore(election['turnout'])

# Print the type of turnout_zscore
print(type(turnout_zscore))

# Assign turnout_zscore to a new column: election['turnout_zscore']
election['turnout_zscore'] = turnout_zscore

# Print the output of election.head()
print(election.head())

<class 'numpy.ndarray'>
      county state   total      Obama     Romney  winner  voters    turnout  \
0      Adams    PA   41973  35.482334  63.112001  Romney   61156  68.632677
1  Allegheny    PA  614671  56.640219  42.185820   Obama  924351  66.497575
2  Armstrong    PA   28322  30.696985  67.901278  Romney   42147  67.198140
3     Beaver    PA   80015  46.032619  52.637630  Romney  115157  69.483401
4    Bedford    PA   21444  22.057452  76.986570  Romney   32189  66.619031

      margin color  turnout_zscore
0  27.629667   red        0.853734
1  14.454399  blue        0.439846
2  37.204293   red        0.575650
3   6.605012   red        1.018647
4  54.929118   red        0.463391

## Changing index of a DataFrame

As you saw in the previous exercise, `indexes are immutable objects`. This means that if you want to change or modify the index in a DataFrame, then you need to change the whole index. You will do this now, using a list comprehension to create the new index.

A `list comprehension` is a succinct way to generate a list in one line. For example, the following list comprehension generates a list that contains the cubes of all numbers from 0 to 9: `cubes = [i**3 for i in range(10)]`. This is equivalent to the following code:

In [55]:
cubes = []
for i in range(10):
    cubes.append(i**3)

Before getting started, print the sales DataFrame and verify that the index is given by month abbreviations containing lowercase characters.

In [58]:
sales = pd.read_csv('data/sales2.csv', index_col='month')
sales.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

In [60]:
# Create the list of new indexes: new_idx
new_idx = [item.upper() for item in sales.index]

# Assign new_idx to sales.index
sales.index = new_idx

# Print the sales DataFrame
sales

     eggs  salt  spam
JAN    47  12.0    17
FEB   110  50.0    31
MAR   221  89.0    72
APR    77  87.0    20
MAY   132   NaN    52
JUN   205  60.0    55

## Changing index name labels

Notice that in the previous exercise, the index was not labeled with a name. In this exercise, you will set its name to `'MONTHS'`.

Similarly, if all the columns are related in some way, you can provide a label for the set of columns.

To get started, print the sales DataFrame and verify that the index has no name, only its data (the month names).

In [61]:
sales

     eggs  salt  spam
JAN    47  12.0    17
FEB   110  50.0    31
MAR   221  89.0    72
APR    77  87.0    20
MAY   132   NaN    52
JUN   205  60.0    55

In [62]:
# Assign the string 'MONTHS' to sales.index.name
sales.index.name = 'MONTHS'

# Print the sales DataFrame
sales

        eggs  salt  spam
MONTHS
JAN       47  12.0    17
FEB      110  50.0    31
MAR      221  89.0    72
APR       77  87.0    20
MAY      132   NaN    52
JUN      205  60.0    55

In [63]:
# Assign the string 'PRODUCTS' to sales.columns.name 
sales.columns.name = 'PRODUCTS'

# Print the sales dataframe again
sales

PRODUCTS  eggs  salt  spam
MONTHS
JAN         47  12.0    17
FEB        110  50.0    31
MAR        221  89.0    72
APR         77  87.0    20
MAY        132   NaN    52
JUN        205  60.0    55

## Building an index, then a DataFrame

You can also build the DataFrame and index independently, and then put them together. If you take this route, be careful, as any mistakes in generating the DataFrame or the index can cause the data and the index to be aligned incorrectly.

In this exercise, the `sales` DataFrame has been provided for you without the month index. Your job is to build this index separately and then assign it to the sales DataFrame. Before getting started, print the sales DataFrame and note that it's missing the month information.

In [67]:
sales = pd.read_csv('data/sales2.csv')
del sales['month']
sales.head()

   eggs  salt  spam
0    47  12.0    17
1   110  50.0    31
2   221  89.0    72
3    77  87.0    20
4   132   NaN    52

In [68]:
# Generate the list of months: months
months = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun']

# Assign months to sales.index
sales.index = months

# Print the modified sales DataFrame
sales

     eggs  salt  spam
Jan    47  12.0    17
Feb   110  50.0    31
Mar   221  89.0    72
Apr    77  87.0    20
May   132   NaN    52
Jun   205  60.0    55

## Extracting data with a MultiIndex

The sales DataFrame you have been working with has been extended to now include State information as well. Print the new sales DataFrame to inspect the data. Take note of the **MultiIndex**!

Extracting elements from the outermost level of a **MultiIndex** is just like in the case of a single-level Index. You can use the `.loc[]` accessor.

In [70]:
sales = pd.read_csv('data/sales3.csv', index_col=['state', 'month'])
sales.head()

             eggs  salt  spam
state month
CA    1        47  12.0    17
      2       110  50.0    31
NY    1       221  89.0    72
      2        77  87.0    20
TX    1       132   NaN    52

In [71]:
sales.loc[['CA', 'TX']]

             eggs  salt  spam
state month
CA    1        47  12.0    17
      2       110  50.0    31
TX    1       132   NaN    52
      2       205  60.0    55

In [72]:
sales['CA':'TX']

             eggs  salt  spam
state month
CA    1        47  12.0    17
      2       110  50.0    31
NY    1       221  89.0    72
      2        77  87.0    20
TX    1       132   NaN    52
      2       205  60.0    55

## Setting & sorting a MultiIndex

In the previous exercise, the **MultiIndex** was created and sorted for you. Now, you're going to do this yourself! With a **MultiIndex**, you should always ensure the index is sorted. You can skip this only if you know the data is already sorted on the index fields.

To get started, print the pre-loaded sales DataFrame to verify that there is no MultiIndex.

In [73]:
sales = pd.read_csv('data/sales3.csv')
sales.head()

  state  month  eggs  salt  spam
0    CA      1    47  12.0    17
1    CA      2   110  50.0    31
2    NY      1   221  89.0    72
3    NY      2    77  87.0    20
4    TX      1   132   NaN    52

In [74]:
# Set the index to be the columns ['state', 'month']: sales
sales = sales.set_index(['state', 'month'])
sales

             eggs  salt  spam
state month
CA    1        47  12.0    17
      2       110  50.0    31
NY    1       221  89.0    72
      2        77  87.0    20
TX    1       132   NaN    52
      2       205  60.0    55

In [75]:
# Sort the MultiIndex: sales
sales = sales.sort_index()

# Print the sales DataFrame
sales

             eggs  salt  spam
state month
CA    1        47  12.0    17
      2       110  50.0    31
NY    1       221  89.0    72
      2        77  87.0    20
TX    1       132   NaN    52
      2       205  60.0    55

## Using .loc[] with nonunique indexes

`It is always preferable to have a meaningful index that uniquely identifies each row`. Even though pandas does not require unique index values in DataFrames, it works better if the index values are indeed unique. To see an example of this, you will index your sales data by `'state'` in this exercise.

In [76]:
sales = pd.read_csv('data/sales3.csv')
sales.head()

  state  month  eggs  salt  spam
0    CA      1    47  12.0    17
1    CA      2   110  50.0    31
2    NY      1   221  89.0    72
3    NY      2    77  87.0    20
4    TX      1   132   NaN    52

In [77]:
# Set the index to the column 'state': sales
sales = sales.set_index(['state'])

# Print the sales DataFrame
sales

       month  eggs  salt  spam
state
CA         1    47  12.0    17
CA         2   110  50.0    31
NY         1   221  89.0    72
NY         2    77  87.0    20
TX         1   132   NaN    52
TX         2   205  60.0    55

In [78]:
# Access the data from 'NY'
sales.loc['NY']

       month  eggs  salt  spam
state
NY         1   221  89.0    72
NY         2    77  87.0    20

## Indexing multiple levels of a MultiIndex

Looking up indexed data is fast and efficient. And you have already seen that lookups based on the `outermost level` of a **MultiIndex** work just like lookups on DataFrames that have a single-level Index.

Looking up data based on `inner levels` of a **MultiIndex** can be a bit trickier. In this exercise, you will use your `sales` DataFrame to do some increasingly complex lookups.

The trickiest of all these lookups are when you want to access some inner levels of the index. In this case, you need to use `slice(None)` in the slicing parameter for the outermost dimension(s) instead of the usual `:`, or use `pd.IndexSlice`. You can refer to the pandas documentation for more details.

`stocks.loc[(slice(None), slice('2016-10-03', '2016-10-04')), :]`

Pay particular attention to the tuple `(slice(None), slice('2016-10-03', '2016-10-04'))`.

In [79]:
sales = pd.read_csv('data/sales3.csv', index_col=['state', 'month'])
sales.head()

             eggs  salt  spam
state month
CA    1        47  12.0    17
      2       110  50.0    31
NY    1       221  89.0    72
      2        77  87.0    20
TX    1       132   NaN    52

In [89]:
# Look up data for NY in month 1: NY_month1
#NY_month1 = sales.loc[('NY', 1), :]
#NY_month1 = sales.loc['NY', 1, :]
NY_month1 = sales.loc['NY', 1]
NY_month1

eggs    221.0
salt     89.0
spam     72.0
Name: (NY, 1), dtype: float64

In [90]:
# Look up data for CA and TX in month 2: CA_TX_month2
CA_TX_month2 = sales.loc[(['CA', 'TX'], 2), :]
CA_TX_month2

             eggs  salt  spam
state month
CA    2       110  50.0    31
TX    2       205  60.0    55

In [92]:
# Look up data for all states in month 2: all_month2
all_month2 = sales.loc[(['CA','NY','TX'], 2), :]
all_month2

             eggs  salt  spam
state month
CA    2       110  50.0    31
NY    2        77  87.0    20
TX    2       205  60.0    55

## Pivoting a single variable

Suppose you started a blog for a band, and you would like to log how many visitors you have had, and how many signed-up for your newsletter. To help design the tours later, you track where the visitors are. A DataFrame called `users` consisting of this information has been pre-loaded for you.

Inspect users and make a note of which variable you want to use to index the rows (`'weekday'`), which variable you want to use to index the columns (`'city'`), and which variable will populate the values in the cells (`'visitors'`). Try to visualize what the result should be.

For example, if we use `'treatment'` to index the rows, `'gender'` to index the columns, and `'response'` to populate the cells. Prior to pivoting, the DataFrame looked like this:

   id treatment gender  response
0   1         A      F         5
1   2         A      M         3
2   3         B      F         8
3   4         B      M         9

After pivoting:

gender     F  M
treatment      
A          5  3
B          8  9

In this exercise, your job is to pivot users so that the focus is on `'visitors'`, with the columns indexed by `'city'` and the rows indexed by `'weekday'`.

In [93]:
users = pd.read_csv('data/users.csv')
users.head()

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [94]:
# Pivot the users DataFrame: visitors_pivot
visitors_pivot = users.pivot(index='weekday', columns='city', values='visitors')

# Print the pivoted DataFrame
visitors_pivot

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

## Pivoting all variables

If you do not select any particular variables, all of them will be pivoted. In this case - with the `users` DataFrame - both `'visitors'` and `'signups'` will be pivoted, creating hierarchical column labels.

In [96]:
# Pivot users with signups indexed by weekday and city: signups_pivot
signups_pivot = users.pivot(index='weekday', columns='city', values='signups')

# Print signups_pivot
signups_pivot

city     Austin  Dallas
weekday
Mon           3       5
Sun           7      12

In [97]:
# Pivot users pivoted by both signups and visitors: pivot
pivot = users.pivot(index='weekday', columns='city')

# Print the pivoted DataFrame
pivot

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

## Stacking & unstacking I

You are now going to practice **stacking** and **unstacking** DataFrames. The `users` DataFrame you have been working with in this chapter has been pre-loaded for you, this time with a MultiIndex. Explore it to see the data layout. Pay attention to the index, and notice that the index levels are `['city', 'weekday']`. So `'weekday'` - the second entry - has position 1. This position is what corresponds to the level parameter in `.stack()` and `.unstack()` calls. Alternatively, you can specify `'weekday'` as the level instead of its position.

Your job in this exercise is to unstack users by `'weekday'`. You will then use `.stack()` on the unstacked DataFrame to see if you get back the original layout of users.

In [138]:
users = pd.read_csv('data/users.csv', index_col=['city', 'weekday'])
users.reset_index()
users.head()

                visitors  signups
city   weekday
Austin Sun           139        7
Dallas Sun           237       12
Austin Mon           326        3
Dallas Mon           456        5

In [139]:
# Unstack users by 'weekday': byweekday
# Define a DataFrame byweekday with the 'weekday' level of users unstacked.
byweekday = users.unstack('weekday')

# Print the byweekday DataFrame
byweekday

        visitors      signups
weekday      Mon  Sun     Mon Sun
city
Austin       326  139       3   7
Dallas       456  237       5  12

In [140]:
# Stack byweekday by 'weekday' and print it
# Stack byweekday by 'weekday' and print it to check if you get 
#  the same layout as the original users DataFrame.
byweekday.stack(level='weekday')

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

## Stacking & unstacking II

You are now going to continue working with the `users` DataFrame. As always, first explore it to see the layout and note the index.

Your job in this exercise is to unstack and then stack the `'city'` level, as you did previously for 'weekday'. Note that you won't get the same DataFrame.

In [141]:
# Unstack users by 'city': bycity
bycity = users.unstack(level=0)
bycity

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

In [142]:
# Stack bycity by 'city' and print it
bycity.stack('city')

                visitors  signups
weekday city
Mon     Austin       326        3
        Dallas       456        5
Sun     Austin       139        7
        Dallas       237       12

## Restoring the index order

Continuing from the previous exercise, you will now use `.swaplevel(0, 1)` to flip the index levels. Note they won't be sorted. To sort them, you will have to follow up with a `.sort_index()`. You will then obtain the original DataFrame. Note that an `unsorted index leads to slicing failures`.

To begin, print both `users` and `bycity`. The goal here is to convert bycity back to something that looks like users.

In [143]:
users

                visitors  signups
city   weekday
Austin Sun           139        7
Dallas Sun           237       12
Austin Mon           326        3
Dallas Mon           456        5

In [144]:
bycity

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

In [145]:
# Stack 'city' back into the index of bycity: newusers
newusers = bycity.stack(level='city')
newusers

                visitors  signups
weekday city
Mon     Austin       326        3
        Dallas       456        5
Sun     Austin       139        7
        Dallas       237       12

In [146]:
# Swap the levels of the index of newusers: newusers
newusers = newusers.swaplevel(0, 1)
newusers

                visitors  signups
city   weekday
Austin Mon           326        3
Dallas Mon           456        5
Austin Sun           139        7
Dallas Sun           237       12

In [147]:
# Sort the index of newusers: newusers
newusers = newusers.sort_index()
newusers

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [148]:
users.sort_index()

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

## Adding names for readability

You are now going to practice **melting** DataFrames. A DataFrame called `visitors_by_city_weekday` has been pre-loaded for you. Explore it and see that it is the `users` DataFrame from previous exercises with the rows indexed by `'weekday'`, columns indexed by `'city'`, and values populated with `'visitors'`.

The goal of **melting** is to restore a **pivoted** DataFrame to its original form, or to change it from a **wide shape** to a **long shape**. You can explicitly specify the columns that should remain in the reshaped DataFrame with `id_vars`, and list which columns to convert into values with `value_vars`. If you don't pass a name to the values in `pd.melt()`, you will lose the name of your variable. You can fix this by using the `value_name` keyword argument.

Your job in this exercise is to **melt** `visitors_by_city_weekday` to move the city names from the column labels to values in a single column called `'city'`. If you were to use just `pd.melt(visitors_by_city_weekday)`, you would obtain the following result:

      city value
0  weekday   Mon
1  weekday   Sun
2   Austin   326
3   Austin   139
4   Dallas   456
5   Dallas   237

Therefore, you have to specify the `id_vars` keyword argument to ensure that `'weekday'` is retained in the reshaped DataFrame, and the `value_name` keyword argument to change the name of value to visitors.

In [152]:
# Reset the index: visitors_by_city_weekday
visitors = users.reset_index() 

# Print visitors_by_city_weekday
visitors

     city weekday  visitors  signups
0  Austin     Sun       139        7
1  Dallas     Sun       237       12
2  Austin     Mon       326        3
3  Dallas     Mon       456        5

In [153]:
# Melt visitors_by_city_weekday: visitors
visitors = pd.melt(visitors, id_vars=['weekday'], value_name='visitors')

# Print visitors
visitors

   weekday  variable visitors
0      Sun      city   Austin
1      Sun      city   Dallas
2      Mon      city   Austin
3      Mon      city   Dallas
4      Sun  visitors      139
5      Sun  visitors      237
6      Mon  visitors      326
7      Mon  visitors      456
8      Sun   signups        7
9      Sun   signups       12
10     Mon   signups        3
11     Mon   signups        5

## Going from wide to long

`You can move multiple columns into a single column (making the data long and skinny)` by **"melting"** multiple columns. In this exercise, you will practice doing this.

In [158]:
users = users.reset_index()
del users['index']
del users['level_0']
users

     city weekday  visitors  signups
0  Austin     Sun       139        7
1  Dallas     Sun       237       12
2  Austin     Mon       326        3
3  Dallas     Mon       456        5

In [159]:
# Melt users: skinny
# Define a DataFrame skinny where you melt the 'visitors' 
#  and 'signups' columns of users into a single column.
skinny = pd.melt(users, id_vars=['weekday', 'city'])

# Print skinny
skinny

  weekday    city  variable  value
0     Sun  Austin  visitors    139
1     Sun  Dallas  visitors    237
2     Mon  Austin  visitors    326
3     Mon  Dallas  visitors    456
4     Sun  Austin   signups      7
5     Sun  Dallas   signups     12
6     Mon  Austin   signups      3
7     Mon  Dallas   signups      5

## Obtaining key-value pairs with melt()

Sometimes, all you need is some key-value pairs, and the context does not matter. If said context is in the index, you can easily obtain what you want. For example, in the `users` DataFrame, the visitors and signups columns lend themselves well to being represented as key-value pairs. So if you created a hierarchical index with 'city' and 'weekday' columns as the index, you can easily extract key-value pairs for the 'visitors' and 'signups' columns by **melting** users and specifying `col_level=0`.

In [161]:
users = users.reset_index()
del users['index']
del users['level_0']
users

     city weekday  visitors  signups
0  Austin     Sun       139        7
1  Dallas     Sun       237       12
2  Austin     Mon       326        3
3  Dallas     Mon       456        5

In [162]:
# Set the new index: users_idx
# Set the index of users to ['city', 'weekday'].
users_idx = users.set_index(['city', 'weekday'])

# Print the users_idx DataFrame
users_idx

                visitors  signups
city   weekday
Austin Sun           139        7
Dallas Sun           237       12
Austin Mon           326        3
Dallas Mon           456        5

In [163]:
# Obtain the key-value pairs: kv_pairs
# Obtain the key-value pairs corresponding to visitors 
#  and signups by melting users_idx with the keyword argument col_level=0.
kv_pairs = pd.melt(users_idx, col_level=0)

# Print the key-value pairs
kv_pairs

   variable  value
0  visitors    139
1  visitors    237
2  visitors    326
3  visitors    456
4   signups      7
5   signups     12
6   signups      3
7   signups      5

## Setting up a pivot table

A **pivot table** allows you to see all of your variables as a function of two other variables. In this exercise, you will use the `.pivot_table()` method to see how the users DataFrame entries appear when presented as functions of the `'weekday'` and `'city'` columns. That is, with the rows indexed by `'weekday'` and the columns indexed by `'city'`.

Before using the pivot table, print the users DataFrame and observe the layout.

In [170]:
users = pd.read_csv('data/users.csv', index_col=['city', 'weekday'])
users = users.reset_index()
users

     city weekday  visitors  signups
0  Austin     Sun       139        7
1  Dallas     Sun       237       12
2  Austin     Mon       326        3
3  Dallas     Mon       456        5

In [172]:
# Create the DataFrame with the appropriate pivot table: by_city_day
# Use a pivot table to index the rows of users by 'weekday' 
#  and the columns of users by 'city'. These correspond 
#  to the index and columns parameters of .pivot_table().
by_city_day = users.pivot_table(index='weekday', columns='city')

# Print by_city_day
by_city_day

        signups        visitors
city     Austin Dallas   Austin Dallas
weekday
Mon           3      5      326    456
Sun           7     12      139    237

## Using other aggregations in pivot tables

You can also use aggregation functions within a **pivot table** by specifying the `aggfunc` parameter. In this exercise, you will practice using the `'count'` and `len` aggregation functions - which produce the same result - on the `users` DataFrame.

In [173]:
users = pd.read_csv('data/users.csv', index_col=['city', 'weekday'])
users = users.reset_index()
users

     city weekday  visitors  signups
0  Austin     Sun       139        7
1  Dallas     Sun       237       12
2  Austin     Mon       326        3
3  Dallas     Mon       456        5

In [174]:
# Use a pivot table to display the count of each column: count_by_weekday1
# Define a DataFrame count_by_weekday1 that shows the count 
#  of each column with the parameter aggfunc='count'. 
#  The index here is 'weekday'.
count_by_weekday1 = users.pivot_table(index='weekday', aggfunc='count')

# Print count_by_weekday
count_by_weekday1

         city  signups  visitors
weekday
Mon         2        2         2
Sun         2        2         2

In [175]:
# Replace 'aggfunc='count'' with 'aggfunc=len': count_by_weekday2
count_by_weekday2 = users.pivot_table(index='weekday', aggfunc=len)

# Verify that the same result is obtained
print('==========================================')
print(count_by_weekday1.equals(count_by_weekday2))

==========================================
True

## Using margins in pivot tables

Sometimes it's useful to add totals in the margins of a **pivot table**. You can do this with the argument `margins=True`. In this exercise, you will practice using `margins` in a pivot table along with a new aggregation function: sum.

In [176]:
users = pd.read_csv('data/users.csv', index_col=['city', 'weekday'])
users = users.reset_index()
users

     city weekday  visitors  signups
0  Austin     Sun       139        7
1  Dallas     Sun       237       12
2  Austin     Mon       326        3
3  Dallas     Mon       456        5

In [177]:
# Create the DataFrame with the appropriate pivot table: signups_and_visitors
# Define a DataFrame signups_and_visitors that shows the breakdown of 
#  signups and visitors by day. You will need to use aggfunc=sum to do this.
signups_and_visitors = users.pivot_table(index='weekday', aggfunc=sum)

# Print signups_and_visitors
signups_and_visitors

         signups  visitors
weekday
Mon            8       782
Sun           19       376

In [178]:
# Add in the margins: signups_and_visitors_total 
# Now pass the additional argument margins=True to 
#  the .pivot_table() method to obtain the totals.
signups_and_visitors_total = users.pivot_table(index='weekday', margins=True, aggfunc=sum)

# Print signups_and_visitors_total
signups_and_visitors_total

         signups  visitors
weekday
Mon            8       782
Sun           19       376
All           27      1158

## Advantages of categorical data types

What are the main advantages of storing data explicitly as **categorical types** instead of **object types**?

- Computations are faster.
- Categorical data require less space in memory.

## Grouping by multiple columns

In this exercise, you will return to working with the Titanic dataset and use `.groupby()` to analyze the distribution of passengers who boarded the Titanic.

The `'pclass'` column identifies which class of ticket was purchased by the passenger and the `'embarked'` column indicates at which of the three ports the passenger boarded the Titanic. `'S'` stands for Southampton, England, `'C'` for Cherbourg, France and `'Q'` for Queenstown, Ireland.

Your job is to first group by the `'pclass'` column and count the number of rows in each class using the `'survived'` column. You will then group by the `'embarked'` and `'pclass'` columns and count the number of passengers.

In [179]:
titanic = pd.read_csv('data/titanic2.csv')
titanic = titanic.drop(['Unnamed: 0'], axis=1)
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [184]:
# Group titanic by 'pclass'
by_class = titanic.groupby('pclass')

# Aggregate 'survived' column of by_class by count
count_by_class = by_class['survived'].count()

# Print count_by_class
count_by_class

pclass
1    323
2    277
3    709
Name: survived, dtype: int64

In [185]:
# Group titanic by 'embarked' and 'pclass'
by_mult = titanic.groupby(['embarked', 'pclass'])

# Aggregate 'survived' column of by_mult by count
count_mult = by_mult['survived'].count()

# Print count_mult
count_mult

embarked  pclass
C         1         141
          2          28
          3         101
Q         1           3
          2           7
          3         113
S         1         177
          2         242
          3         495
Name: survived, dtype: int64

## Grouping by another series

In this exercise, you'll use two data sets from Gapminder.org to investigate the average life expectancy (in years) at birth in 2010 for the 6 continental regions. To do this you'll read the life expectancy data per country into one pandas DataFrame and the association between country and region into another.

By setting the index of both DataFrames to the country name, you'll then use the region information to group the countries in the life expectancy DataFrame and compute the mean value for 2010.

The life expectancy CSV file is available to you in the variable `life_fname` and the regions filename is available in the variable `regions_fname`.

In [186]:
life_fname = 'https://s3.amazonaws.com/assets.datacamp.com/production/course_1650/datasets/life_expectancy.csv'
regions_fname = 'https://s3.amazonaws.com/assets.datacamp.com/production/course_1650/datasets/regions.csv'

In [187]:
# Read life_fname into a DataFrame: life
life = pd.read_csv(life_fname, index_col='Country')
life.head()

,1964,1965,1966,1967,1968,1969,1970,1971,1972,1973,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
Country,,,,,,,,,,,,,,,,,,,,,
Afghanistan,33.639,34.152,34.662,35.170,35.674,36.172,36.663,37.143,37.614,38.075,...,56.583,57.071,57.582,58.102,58.618,59.124,59.612,60.079,60.524,60.947
Albania,65.475,65.863,66.122,66.316,66.500,66.702,66.948,67.251,67.595,67.966,...,75.725,75.949,76.124,76.278,76.433,76.598,76.780,76.979,77.185,77.392
Algeria,47.953,48.389,48.806,49.205,49.592,49.976,50.366,50.767,51.195,51.670,...,69.682,69.854,70.020,70.180,70.332,70.477,70.615,70.747,70.874,71.000
Angola,34.604,35.007,35.410,35.816,36.222,36.627,37.032,37.439,37.846,38.247,...,48.036,48.572,49.041,49.471,49.882,50.286,50.689,51.094,51.498,51.899
Antigua and Barbuda,63.775,64.149,64.511,64.865,65.213,65.558,65.898,66.232,66.558,66.875,...,74.355,74.544,74.729,74.910,75.087,75.263,75.437,75.610,75.783,75.954

In [191]:
# Read regions_fname into a DataFrame: regions
regions = pd.read_csv(regions_fname, index_col='Country')
regions.head()

                                         region
Country
Afghanistan                          South Asia
Albania                   Europe & Central Asia
Algeria              Middle East & North Africa
Angola                       Sub-Saharan Africa
Antigua and Barbuda                     America

In [192]:
# Group life by regions['region']: life_by_region
life_by_region = life.groupby(regions['region'])
life_by_region.head()

,1964,1965,1966,1967,1968,1969,1970,1971,1972,1973,...,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013
Country,,,,,,,,,,,,,,,,,,,,,
Afghanistan,33.63900,34.1520,34.6620,35.17000,35.6740,36.1720,36.6630,37.14300,37.61400,38.0750,...,56.583,57.071,57.582,58.102,58.618,59.124,59.612,60.079,60.524,60.947
Albania,65.47500,65.8630,66.1220,66.31600,66.5000,66.7020,66.9480,67.25100,67.59500,67.9660,...,75.725,75.949,76.124,76.278,76.433,76.598,76.780,76.979,77.185,77.392
Algeria,47.95300,48.3890,48.8060,49.20500,49.5920,49.9760,50.3660,50.76700,51.19500,51.6700,...,69.682,69.854,70.020,70.180,70.332,70.477,70.615,70.747,70.874,71.000
Angola,34.60400,35.0070,35.4100,35.81600,36.2220,36.6270,37.0320,37.43900,37.84600,38.2470,...,48.036,48.572,49.041,49.471,49.882,50.286,50.689,51.094,51.498,51.899
Antigua and Barbuda,63.77500,64.1490,64.5110,64.86500,65.2130,65.5580,65.8980,66.23200,66.55800,66.8750,...,74.355,74.544,74.729,74.910,75.087,75.263,75.437,75.610,75.783,75.954
Argentina,65.38800,65.4810,65.6030,65.75900,65.9530,66.1840,66.4490,66.74000,67.04400,67.3490,...,74.645,74.843,75.036,75.225,75.410,75.592,75.772,75.950,76.128,76.305
Armenia,67.71400,68.1510,68.5870,69.01500,69.4250,69.8080,70.1430,70.41100,70.60400,70.7220,...,73.192,73.491,73.730,73.920,74.070,74.191,74.291,74.381,74.469,74.561
Aruba,67.11300,67.4350,67.7620,68.09500,68.4360,68.7840,69.1400,69.49800,69.85100,70.1920,...,74.175,74.316,74.467,74.621,74.772,74.919,75.059,75.193,75.324,75.455
Australia,70.65000,70.9800,70.8200,71.10000,70.7300,71.1400,70.8100,71.41000,71.93000,72.1400,...,81.040,81.440,81.630,81.670,81.567,81.937,82.091,82.231,82.364,82.496
Austria,70.16000,69.9500,70.2600,70.14000,70.2900,70.0600,70.1100,70.31000,70.63000,71.2100,...,79.470,79.640,80.100,80.300,80.510,80.392,80.595,80.785,80.965,81.137
Azerbaijan,62.70100,63.1170,63.5330,63.94500,64.3420,64.7120,65.0350,65.28700,65.45700,65.5450,...,68.570,69.033,69.466,69.841,70.142,70.366,70.518,70.616,70.686,70.753
Bahamas,64.18900,64.4980,64.8000,65.09500,65.3830,65.6650,65.9430,66.21800,66.49000,66.7590,...,73.538,73.787,74.011,74.216,74.407,74.587,74.757,74.920,75.079,75.237
Bahrain,57.18200,58.3890,59.5260,60.59900,61.6110,62.5620,63.4500,64.27600,65.04300,65.7570,...,75.247,75.424,75.595,75.759,75.914,76.062,76.203,76.339,76.474,76.608
Bangladesh,49.29700,49.6520,49.7340,49.50900,49.0080,48.3070,47.5800,47.04600,46.87400,47.1620,...,67.064,67.465,67.860,68.253,68.648,69.046,69.449,69.854,70.258,70.657
Barbados,62.81900,63.2360,63.6410,64.03600,64.4220,64.7980,65.1640,65.51900,65.86300,66.1950,...,73.840,74.018,74.194,74.368,74.539,74.708,74.875,75.041,75.205,75.370
Belarus,73.48000,73.0200,73.3800,73.13000,73.2400,72.8400,72.3200,72.96000,72.67000,72.7100,...,69.090,68.840,69.510,70.410,69.194,69.468,69.613,69.728,69.829,69.928
Benin,39.14200,39.6440,40.1640,40.70200,41.2520,41.8130,42.3800,42.94800,43.51300,44.0680,...,56.700,57.131,57.549,57.933,58.272,58.560,58.797,58.992,59.165,59.330
Bhutan,33.82700,34.2120,34.6360,35.11500,35.6580,36.2690,36.9470,37.68800,38.47600,39.2920,...,63.323,64.050,64.741,65.387,65.981,66.523,67.015,67.465,67.888,68.294
Botswana,52.03500,52.3840,52.7640,53.18600,53.6590,54.1840,54.7590,55.37900,56.02700,56.6860,...,47.257,46.836,46.565,46.422,46.384,46.441,46.588,46.824,47.152,47.572
Brunei,64.59900,65.0780,65.5360,65.97500,66.4030,66.8210,67.2310,67.63200,68.02500,68.4070,...,76.783,76.982,77.178,77.372,77.566,77.760,77.956,78.153,78.350,78.547
Burkina Faso,36.33100,36.8150,37.2910,37.75400,38.2070,38.6520,39.0950,39.54200,40.00300,40.4930,...,52.278,52.750,53.227,53.703,54.174,54.634,55.081,55.513,55.932,56.344
Burundi,42.54300,42.8410,43.1060,43.33200,43.5190,43.6790,43.8330,44.01100,44.23600,44.5220,...,49.589,50.036,50.526,51.045,51.578,52.112,52.638,53.148,53.637,54.104
Cambodia,41.90000,42.1030,42.3320,42.53800,42.6210,42.4600,41.6620,40.00000,38.00000,35.8000,...,66.177,67.199,68.143,68.984,69.710,70.315,70.811,71.220,71.577,71.916
China,53.32072,55.6468,56.8032,58.38112,59.4052,60.9652,62.6508,63.73736,63.11888,62.7808,...,73.793,74.053,74.253,74.418,74.570,74.718,74.868,75.023,75.178,75.331
Djibouti,45.72700,46.1660,46.6540,47.20300,47.8140,48.4760,49.1600,49.82700,50.44200,50.9820,...,57.678,57.996,58.380,58.816,59.292,59.794,60.307,60.819,61.319,61.801
Egypt,50.13300,50.5780,50.9770,51.32500,51.6250,51.8980,52.1790,52.51200,52.92600,53.4400,...,69.299,69.464,69.645,69.838,70.042,70.256,70.478,70.705,70.933,71.157
Fiji,57.54500,57.9500,58.3500,58.74100,59.1230,59.4950,59.8570,60.20700,60.54600,60.8730,...,68.243,68.405,68.567,68.733,68.903,69.078,69.258,69.442,69.626,69.810
India,44.37500,45.1410,45.9030,46.65500,47.3940,48.1190,48.8360,49.55400,50.28100,51.0150,...,63.684,64.056,64.412,64.751,65.070,65.369,65.650,65.915,66.168,66.414
Iran,47.17300,47.7300,48.3000,48.88900,49.5050,50.1500,50.8560,51.66200,52.56100,53.5140,...,71.126,71.467,71.797,72.122,72.445,72.769,73.094,73.417,73.736,74.048
Maldives,38.91100,39.7930,40.6940,41.59500,42.4790,43.3340,44.1530,44.93400,45.69000,46.4350,...,73.066,73.871,74.593,75.238,75.813,76.324,76.779,77.188,77.564,77.919

In [193]:
# Print the mean over the '2010' column of life_by_region
print(life_by_region['2010'].mean())

region
America                       74.037350
East Asia & Pacific           73.405750
Europe & Central Asia         75.656387
Middle East & North Africa    72.805333
South Asia                    68.189750
Sub-Saharan Africa            57.575080
Name: 2010, dtype: float64

## Computing multiple aggregates of multiple columns

The `.agg()` method can be used with a tuple or list of aggregations as input. When applying multiple aggregations on multiple columns, the aggregated DataFrame has a multi-level column index.

In this exercise, you're going to group passengers on the Titanic by `'pclass'` and aggregate the `'age'` and `'fare'` columns by the functions `'max'` and `'median'`. You'll then use multi-level selection to find the oldest passenger per class and the median fare price per class.

In [194]:
titanic = pd.read_csv('data/titanic2.csv')
titanic = titanic.drop(['Unnamed: 0'], axis=1)
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [195]:
# Group titanic by 'pclass': by_class
by_class = titanic.groupby('pclass')

# Select 'age' and 'fare'
by_class_sub = by_class[['age','fare']]

# Aggregate by_class_sub by 'max' and 'median': aggregated
aggregated = by_class_sub.agg(['max', 'median'])

In [196]:
# Print the maximum age in each class
print(aggregated.loc[:, ('age','max')])

pclass
1    80.0
2    70.0
3    74.0
Name: (age, max), dtype: float64

In [197]:
# Print the median fare in each class
print(aggregated.loc[:, ('fare','median')])

pclass
1    60.0000
2    15.0458
3     8.0500
Name: (fare, median), dtype: float64